# Relatorio e analise 1 
## Importando a base de dados

In [9]:
import pandas as pd 
dados = pd.read_csv('data/aluguel.csv', sep=';')
dados

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
...,...,...,...,...,...,...,...,...,...
32955,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0
32956,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0
32957,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0
32958,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN
32959,Conjunto Comercial/Sala,Centro,0,0,0,250,6500.0,4206.0,1109.0

In [10]:
dados.info() #mosta as informações

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32960 entries, 0 to 32959
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        32960 non-null  object
 1   Bairro      32960 non-null  object
 2   Quartos     32960 non-null  int64
 3   Vagas       32960 non-null  int64
 4   Suites      32960 non-null  int64
 5   Area        32960 non-null  int64
 6   Valor       32943 non-null  float64
 7   Condominio  28867 non-null  float64
 8   IPTU        22723 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.3+ MB
None

In [8]:
dados.head(10) # mostra os 5 primeiros no default, podendo colocar o valor de linhas que voce quer ver

                      Tipo           Bairro  Quartos  Vagas  Suites  Area  \
0                Quitinete       Copacabana        1      0       0    40
1                     Casa  Jardim Botânico        2      0       1   100
2  Conjunto Comercial/Sala  Barra da Tijuca        0      4       0   150
3              Apartamento           Centro        1      0       0    15
4              Apartamento     Higienópolis        1      0       0    48
5              Apartamento     Vista Alegre        3      1       0    70
6              Apartamento         Cachambi        2      0       0    50
7       Casa de Condomínio  Barra da Tijuca        5      4       5   750
8       Casa de Condomínio            Ramos        2      2       0    65
9  Conjunto Comercial/Sala           Centro        0      3       0   695

     Valor  Condominio    IPTU
0   1700.0       500.0    60.0
1   7000.0         NaN     NaN
2   5200.0      4020.0  1111.0
3    800.0       390.0    20.0
4    800.0       230.0     NaN
5   1200.0         NaN     NaN
6   1300.0       301.0    17.0
7  22000.0         NaN     NaN
8   1000.0         NaN     NaN
9  35000.0     19193.0  3030.0

## informações gerais sobre a base de dados

In [11]:
dados.dtypes #mostrar o tipo de dados object = str

Tipo           object
Bairro         object
Quartos         int64
Vagas           int64
Suites          int64
Area            int64
Valor         float64
Condominio    float64
IPTU          float64
dtype: object

In [13]:
pd.DataFrame(dados.dtypes) # mostrar de uma forma mais bonita

                  0
Tipo         object
Bairro       object
Quartos       int64
Vagas         int64
Suites        int64
Area          int64
Valor       float64
Condominio  float64
IPTU        float64

In [15]:
tipos_de_dados = pd.DataFrame(dados.dtypes, columns=['Tipos de dados']) # especificar o nome da coluna

In [18]:
tipos_de_dados.columns.name = 'Variaveis'  #columns.name da o nome das veriaveis da primeira coluna

In [17]:
tipos_de_dados

Variaveis  Tipos de dados
Tipo               object
Bairro             object
Quartos             int64
Vagas               int64
Suites              int64
Area                int64
Valor             float64
Condominio        float64
IPTU              float64

In [20]:
dados.shape #numero de linhas, numero de variaveis

(32960, 9)

In [22]:
dados.shape[0] #numero de linhas

32960

In [24]:
dados.shape[1] #numero de variaveis

9

In [25]:
print(f'A base de dados apresenta {dados.shape[0]} registros (imoveis) e {dados.shape[1]} variaveis')

A base de dados apresenta 32960 registros (imoveis) e 9 variaveis